src/cfe/КСП/Catalogs/мис_УправлениеЗаданиями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>мис_УправлениеЗаданиями</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроцедураСПараметрами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПроцедуры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапускПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СледующаяПроцедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мис_УправлениеЗаданиями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтсутствияОтклика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПовтораПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторовПриАварийномЗавершении</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/мис_УправлениеЗаданиями/Forms/ФормаКопирования/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ГруппаЗаданий = Параметры.КопируемыйЭлемент;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Если Вопрос("Скопировать группу заданий?",РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет)<>КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Закрыть();
	Иначе
		КопироватьШаблонС();
		ЭтаФорма.Закрыть(1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Функция КопироватьШаблонС() Экспорт
	
	Попытка
		//Шаблон = Элементы.Список.ТекущаяСтрока;
		СписПар = Новый СписокЗначений;
		СписПар.Добавить(ГруппаЗаданий, "Ссылка");
		ПараметрыВызова = Новый ХранилищеЗначения(СписПар, Новый СжатиеДанных(9));
		ИдВызова	= mis_LoggerServer.СоздатьИдВызова (ИдВызова, "Копирование группы заданий "+Строка(ГруппаЗаданий)+". "+Строка(ТекущаяДатаСеанса()), ТекущаяДатаСеанса(), "КопироватьШаблонС", ПараметрыВызова);

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Спр.Ссылка КАК Ссылка,
		|	Спр.Наименование КАК Наименование
		|ИЗ
		|	Справочник.мис_УправлениеЗаданиями КАК Спр
		|ГДЕ
		|	Спр.Ссылка В ИЕРАРХИИ(&Родитель)
		|	И НЕ Спр.ПометкаУдаления
		|	И НЕ Спр.ЭтоГруппа
		|";

		Запрос.УстановитьПараметр("Родитель", ГруппаЗаданий);

		Результат = Запрос.Выполнить();
		
		НовГруппа = ГруппаЗаданий.Скопировать();
		НовГруппа.Наименование = Префикс + ГруппаЗаданий.Наименование + Суффикс;
		Если ОчиститьПолеСледующаяПроцедура Тогда
			НовГруппа.СледующаяПроцедура = Неопределено;
		КонецЕсли;
		НовГруппа.Записать();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл

			НовЭл = Выборка.Ссылка.Скопировать();
			НовЭл.Наименование = Префикс + Выборка.Наименование + Суффикс;
			
			//в шаблонах и доп начислениях используются исходные счета
			Если ЗаменитьИсходныеСчета Тогда
				ПараметрыПроцедуры = НовЭл.ПараметрыПроцедуры.Получить();
				Для Каждого Стр Из ПараметрыПроцедуры Цикл
					Если НРег(СокрЛП(Стр.Параметр)) = "списоксчетов" Тогда
						Стр.Значение = НовыеИсходныеСчета;
						Стр.ТипЗначения = Новый ОписаниеТипов("СписокЗначений");
						Прервать;
					КонецЕсли;
				КонецЦикла;
				НовЭл.ПараметрыПроцедуры = Новый ХранилищеЗначения(ПараметрыПроцедуры,Новый СжатиеДанных(9));
			КонецЕсли;
			
			//в ФИФО используются сводные счета
			Если ЗаменитьСводныеСчета Тогда
				ПараметрыПроцедуры = НовЭл.ПараметрыПроцедуры.Получить();
				Для Каждого Стр Из ПараметрыПроцедуры Цикл
					Если НРег(СокрЛП(Стр.Параметр)) = "сводныесчета" Тогда
						Стр.Значение = НовыеСводныеСчета;
						Стр.ТипЗначения = Новый ОписаниеТипов("СписокЗначений");
						Прервать;
					КонецЕсли;
				КонецЦикла;
				НовЭл.ПараметрыПроцедуры = Новый ХранилищеЗначения(ПараметрыПроцедуры,Новый СжатиеДанных(9));
			КонецЕсли;
			
			Если ОчиститьПолеСледующаяПроцедура Тогда
				НовЭл.СледующаяПроцедура = Неопределено;
			КонецЕсли;

			НовЭл.Родитель = НовГруппа.Ссылка;
			НовЭл.Записать();
			
		КонецЦикла;
				
		mis_LoggerServer.Информация(ИДВызова, "Информация", "Ошибок нет");
		
		Возврат Истина;
	Исключение
		mis_LoggerServer.Ошибка(ИДВызова, "Ошибка", ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
КонецФункции
